# Preprocessing

In [21]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler

In [39]:
df_titanic = pd.read_csv("./train.csv")
print(df_titanic.shape)

(891, 12)

In [12]:
df_titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [5]:
# Get the description of the data
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [19]:
#Check for nan values for each column
print(df_titanic.isnull().sum(axis = 0))
# Drop the Cabin since there are a lot of Nans
df_titanic = df_titanic.drop(columns="Cabin")

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [23]:
from sklearn.impute import SimpleImputer

# Pipeline for numerical attributes
num_pipeline = Pipeline([
    ("imputer", SimpleImputer(strategy= "median")), # replacing aech attribute's missing value with median
    ("std_scaler", StandardScaler()) # Standardize the dataset
])

In [51]:
# Only transform the numerical columns
num_columns = df_titanic.drop(columns="Survived").select_dtypes(include=['int64',"float64"]).columns
df_titanic_num = df_titanic[num_columns.values]
df_titanic_num.head()

df_titanic_tr = num_pipeline.fit_transform(df_titanic_num)
df_titanic_num[:] = df_titanic_tr
df_titanic_num.head()

ipykernel_launcher:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
/Users/onursurucu/opt/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:1738: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value[:, i].tolist(), pi)

   PassengerId    Pclass       Age     SibSp     Parch      Fare
0    -1.730108  0.827377 -0.565736  0.432793 -0.473674 -0.502445
1    -1.726220 -1.566107  0.663861  0.432793 -0.473674  0.786845
2    -1.722332  0.827377 -0.258337 -0.474545 -0.473674 -0.488854
3    -1.718444 -1.566107  0.433312  0.432793 -0.473674  0.420730
4    -1.714556  0.827377  0.433312 -0.474545 -0.473674 -0.486337